_org/books/The Elements of Typographic Style.org
#+BEGIN_HTML
---
layout: notes
---
#+END_HTML
#+TOC: headlines 4

Notes for The /Elements of Typographic Style/
— Robert Bringhurst

* Introduction
  This is the best book on Typography.
  The book in itself is so carefully written and edited. It is a joy
  to read. It is a must for anyone interested in typography.

* First principles
  * invite the reader into the text;
  * reveal the tenor and meaning of the text;
  * clarify the structure and the order of the text;
  * link the text with other existing elements;
  * induce a state of energetic repose, which is the ideal
  condition for reading.

  Typography is an Art. It exists to honor the text and its
  elements.

* Rhythm & proportion

   * ½ em = 1 en. One em is a distance equal to the type size.
  For example a 6 point font has an em equal to 6 point, a twelve
  font to 12 point etc.
   * a 66 character line is widely regarded as ideal. On page 29,
  there is a diagram showing how to get to this ideal line based on
  line length and alphabet length
   * For strings of capitals, small caps and long string of
  digits, specific letter spacing may be needed.
   * Kerning = altering the space between selected pair of
  letters. It exists kerning tables. Numbers need kerning too but
  are not often kerned.
   * Lead = Interlinear space. Measured from one baseline to the
     other.
   * Font 11/13 = Font font size/lead
   * Vertical space consumed by each departure (headings,
  subheads, quotations etc.) should be an even multiple of the basic
  leading. For 13: 26, 39, 52, 65, 78, 91, 104 etc.
   * Paragraph indent: most of the time 1 em or 1 lead.
   * Never begin a page with the last line of a multi line
     paragraph.
   * Link short numerical and mathematical expression with hard
  space. If a break is needed, break after equal sign on on another
  clear logical pause.
   * Avoid more than three consecutive hyphenated lines
   * Abandon any and all rules of hyphenation and pagination that
  fail to serve the needs of the text.

* Harmony & counterpoint

  * Limit the number of size. Start with one size and work slowly
    from here
  * Use titling figures (uppercase numerals) with full caps and
    text figures (lowercase numerals) in all other circumstances.
  * For abbreviation and acronyms in the midst of normal text, use
    small caps.
    ex: USA is a country.
    But we use Unesco instead of UNESCO because we pronounce it as
    word not as letter.
  * Check if font has good ligatures.
    For example with the word Coeur in French
  * Prefer true italic over sloped fonts
  * Experiment by changing one parameter at a time (to set the
    title for example).
  * Punctuation not in bold. It is the word, not the punctuation
    that merit emphasis.

* Structural forms & devices

  * Titles reflect the properties of the text
  * Titles should not oppress the text
  * Mark each beginning and resumption of the text. Tips: with
    fleurons (p63)
  * Red = typographer habitual second color
  * Versal or lettrine = Large initial capital
  * Title examples on p66
  * I prefer sidenotes to footnotes
  * Edit tables with the same attention as text to be read
    - All text should be horizontal
    - separating the first and/or final column from adjacent empty
      space, ordinarily servers no function.
    - p72 for a good example
  * Avoid overpunctuating list
  * Set lists and columns of figures to align flush right or on
    the decimal.


  * ANALPHABETIC SYMBOLS

  * Midpoint or small bullet • for marking phrases or abbreviations.
  * Use analphabetic symbols and diacritics that are in tune with
    the basic font.
  * Analphabetic characters notorious for poor design
    - [] too dark
    - () too symetrical and skinny
    - *
    - ¶ pilcrow or paragraph mark
    - § section sign often stiff and bland
    - # frequently too large
  * Use best available ampersand (check italic version)
  * - hyphens – en dash  — em dash
  * M/3 em or en dash to indicate a range 3–6 November
  * em dash to introduce speakers
    — So this is a French novel? She said
  * Three em rule for the repetition of a name
    Isaac Asimov. Fondation I.
    ———. Fondation II.
  * Steeper slash is the virgule / (alternative form of the
    comma). Useful in dates and in text
  * Solidus or fraction bar ½ (vulgar fraction unicode)
  * Virgule used to construct level fraction 2π/3
  * Dimension (multiplication) sign × instead of x for dimensions.
  * Use upright rather than sloped parenthesis even if the context
    is italic
  * “outside and ‛inside’ quotation”
  * Dr and Prof. (omit period when abbreviation stars with first
    letter and ends with the last letter of the word).
  * Use accents and alternate sorts that proper names and imported
    word and phrase require.
  * Remap the font driver and keyboard to suit your own
    requirements.

* Choosing & combining type

 * Consider the medium  for which the typeface was originally designed
 * When using digital adaptations of letterpress faces, choose
   fonts that are faithful to the spirit as well as the letter of
   the old designs (presses makes font bigger, adds 3D etc.)
 * Choose faces that will survive, and if possible prosper, under
   the final printing conditions.
 * Choose faces that suit the paper your intend to print on, or
   choose a paper that suits the face you wish to use.
 * Choose a face that suit the task as well as the subject
 * Choose faces that can furnish whatever special effects you require
 * consider face natural idiom, individual spirit and character
 * begin by buying one good face or family. i.e. choose your
   library of faces slowly and well.

* Shaping the page

  * p148-149 list a number of page proportions. Fifth and
          fourth are considered perfect intervals
  * p155-156 (diagram) The Golden section.
	  a:b = b:(a+b)
	  1:ϕ (phi). It is a ratio of 38.2%/61.8% or approximately
          1/1.6
  * Fibonacci series are very good to choose type size
    5•8•13•21•34•55…
    Interlocking series can also be used
    4•7•11•18•29…
    6•10•16•26•42… (this one is doubling Finobacci so it is
    special and can be used to form a two stranded Finobacci)
    Two stranded Finobacci
    6•8•10•13•16•21•26•34•42
    double stranded finobacci used by le corbusier
    4 - 5 - 6.5 - 8 - 10.5 - 13 - 17 - 21 - 27.5 - 34 - 44.5 -
    55 - 72 - 89
  * Choose inherently satisfying page proportions in
    preference to stock sizes or arbitrary shapes.
  * Choose page proportions suited to the content, size and
    ambition of the publication
  * If the text is meant to invite continuous reading, set it
    in columns that are clearly taller than wide.
  * Shape the text-block so that it balances and contrasts
    with the shape of the overall page. p164 shows a good
    example of a text-block.
  * Bring the margins into the design
    - Lock the text-block to the page and lock the facing
      pages to each other
    - Frame the text-block
    - protect the text-block
  * Bring the design into the margins
    Paragraphs indents, blank lines, marginal notes…
  * Mark the reader's way. Folios are useful in documents
    larger than two pages. p165
  * Don't restate the obvious
    Running heads are bad except in anthologies and works of reference.
  * Modular scales are better than grids because they are
    more flexible. Grids are used when unpredictable
    elements must be combined in a rapid and orderly way.
    p169 shows an example of page layouts.
  * Adjusts the type and the spaces within the text-block
    using typographic increments, but rely on free
    proportions to adjust the empty space.
  * Keep the design supple enough to provide a livable home
    for the text

* The state of the art

  * 9.1 p 179 ASCII ISO and characters set
  * ASCII American Standard Code for Information Interchange
    Each character was limited to seven bits of binary information
    so maximum number of characters was 2^7 = 128 - 33 control
   codes - 1 for empty space = 94 slots. Not enough for even
    French, Spanish etc.
  * Extended ASCII is made from 8bits characters. 2^8=256 slots.
    Depending on software it makes 216-230 characters available.
    It is meagre but adequate for basic communication in all the
    official languages of western Europe and north America.
  * Unicode > 100 000 Characters
  * Formats:
    - Bitmapped fonts
    - Postcript fonts defined as scalable
      - Type One (T1)
    - TrueType
      - Gx
      - TTO (TrueType Open)
    - OpenType (OT or OTF)

    Postscript and TrueType have a different approach to hinting
    and descriptive mathematic different.

    TrueType and OpenType can accomodate large character set with
    automatic contextual substitution of variants and ligatures.
  * Manual, random and programmed variation
    Means one font incorporate differents ligatures and glyphs
    depending on the situation.
  * Use the best available justification engine
  * It the text will be read on the screen, design it for that medium

* Grooming the font

  * Check the license before tuning a digital font
  * Respect the text first of all, the letter-forms second, the
    type designer third, the foundry fourth
  * If text figures, ligatures or other glyphs you need on a
    regular basis. Don't reside on the base font, move them.
  * It is wise to check the font by running a test file p204-205
  * Check the kerning of the space
  * Naming conventions: sometimes fonts of the same family are not
    linked because of a small naming mistake.


Appendixes are interesting (glossary of typographic terms).
