books/The Elements of Typographic Style.html
---
layout: notes
---
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. First principles</a></li>
<li><a href="#sec-3">3. Rhythm &amp; proportion</a></li>
<li><a href="#sec-4">4. Harmony &amp; counterpoint</a></li>
<li><a href="#sec-5">5. Structural forms &amp; devices</a></li>
<li><a href="#sec-6">6. Choosing &amp; combining type</a></li>
<li><a href="#sec-7">7. Shaping the page</a></li>
<li><a href="#sec-8">8. The state of the art</a></li>
<li><a href="#sec-9">9. Grooming the font</a></li>
</ul>
</div>
</nav>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This is the best book on Typography.
The book in itself is so carefully written and edited. It is a joy
to read. It is a must for anyone interested in typography.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> First principles</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>invite the reader into the text;
</li>
<li>reveal the tenor and meaning of the text;
</li>
<li>clarify the structure and the order of the text;
</li>
<li>link the text with other existing elements;
</li>
<li>induce a state of energetic repose, which is the ideal
</li>
</ul>
<p>
condition for reading.
</p>

<p>
Typography is an Art. It exists to honor the text and its
elements.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Rhythm &amp; proportion</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>½ em = 1 en. One em is a distance equal to the type size.
</li>
</ul>
<p>
For example a 6 point font has an em equal to 6 point, a twelve
font to 12 point etc.
</p>
<ul class="org-ul">
<li>a 66 character line is widely regarded as ideal. On page 29,
</li>
</ul>
<p>
there is a diagram showing how to get to this ideal line based on
line length and alphabet length
</p>
<ul class="org-ul">
<li>For strings of capitals, small caps and long string of
</li>
</ul>
<p>
digits, specific letter spacing may be needed.
</p>
<ul class="org-ul">
<li>Kerning = altering the space between selected pair of
</li>
</ul>
<p>
letters. It exists kerning tables. Numbers need kerning too but
are not often kerned.
</p>
<ul class="org-ul">
<li>Lead = Interlinear space. Measured from one baseline to the
other.
</li>
<li>Font 11/13 = Font font size/lead
</li>
<li>Vertical space consumed by each departure (headings,
</li>
</ul>
<p>
subheads, quotations etc.) should be an even multiple of the basic
leading. For 13: 26, 39, 52, 65, 78, 91, 104 etc.
</p>
<ul class="org-ul">
<li>Paragraph indent: most of the time 1 em or 1 lead.
</li>
<li>Never begin a page with the last line of a multi line
paragraph.
</li>
<li>Link short numerical and mathematical expression with hard
</li>
</ul>
<p>
space. If a break is needed, break after equal sign on on another
clear logical pause.
</p>
<ul class="org-ul">
<li>Avoid more than three consecutive hyphenated lines
</li>
<li>Abandon any and all rules of hyphenation and pagination that
</li>
</ul>
<p>
fail to serve the needs of the text.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Harmony &amp; counterpoint</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Limit the number of size. Start with one size and work slowly
from here
</li>
<li>Use titling figures (uppercase numerals) with full caps and
text figures (lowercase numerals) in all other circumstances.
</li>
<li>For abbreviation and acronyms in the midst of normal text, use
small caps.
ex: USA is a country.
But we use Unesco instead of UNESCO because we pronounce it as
word not as letter.
</li>
<li>Check if font has good ligatures.
For example with the word Coeur in French
</li>
<li>Prefer true italic over sloped fonts
</li>
<li>Experiment by changing one parameter at a time (to set the
title for example).
</li>
<li>Punctuation not in bold. It is the word, not the punctuation
that merit emphasis.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Structural forms &amp; devices</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Titles reflect the properties of the text
</li>
<li>Titles should not oppress the text
</li>
<li>Mark each beginning and resumption of the text. Tips: with
fleurons (p63)
</li>
<li>Red = typographer habitual second color
</li>
<li>Versal or lettrine = Large initial capital
</li>
<li>Title examples on p66
</li>
<li>I prefer sidenotes to footnotes
</li>
<li>Edit tables with the same attention as text to be read
<ul class="org-ul">
<li>All text should be horizontal
</li>
<li>separating the first and/or final column from adjacent empty
space, ordinarily servers no function.
</li>
<li>p72 for a good example
</li>
</ul>
</li>
<li>Avoid overpunctuating list
</li>
<li>Set lists and columns of figures to align flush right or on
the decimal.
</li>
</ul>


<ul class="org-ul">
<li>ANALPHABETIC SYMBOLS
</li>

<li>Midpoint or small bullet • for marking phrases or abbreviations.
</li>
<li>Use analphabetic symbols and diacritics that are in tune with
the basic font.
</li>
<li>Analphabetic characters notorious for poor design
<ul class="org-ul">
<li>[] too dark
</li>
<li>() too symetrical and skinny
</li>
<li>*
</li>
<li>¶ pilcrow or paragraph mark
</li>
<li>§ section sign often stiff and bland
</li>
<li># frequently too large
</li>
</ul>
</li>
<li>Use best available ampersand (check italic version)
</li>
<li>- hyphens – en dash  — em dash
</li>
<li>M/3 em or en dash to indicate a range 3–6 November
</li>
<li>em dash to introduce speakers
— So this is a French novel? She said
</li>
<li>Three em rule for the repetition of a name
Isaac Asimov. Fondation I.
———. Fondation II.
</li>
<li>Steeper slash is the virgule / (alternative form of the
comma). Useful in dates and in text
</li>
<li>Solidus or fraction bar ½ (vulgar fraction unicode)
</li>
<li>Virgule used to construct level fraction 2π/3
</li>
<li>Dimension (multiplication) sign × instead of x for dimensions.
</li>
<li>Use upright rather than sloped parenthesis even if the context
is italic
</li>
<li>“outside and ‛inside’ quotation”
</li>
<li>Dr and Prof. (omit period when abbreviation stars with first
letter and ends with the last letter of the word).
</li>
<li>Use accents and alternate sorts that proper names and imported
word and phrase require.
</li>
<li>Remap the font driver and keyboard to suit your own
requirements.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Choosing &amp; combining type</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Consider the medium  for which the typeface was originally designed
</li>
<li>When using digital adaptations of letterpress faces, choose
fonts that are faithful to the spirit as well as the letter of
the old designs (presses makes font bigger, adds 3D etc.)
</li>
<li>Choose faces that will survive, and if possible prosper, under
the final printing conditions.
</li>
<li>Choose faces that suit the paper your intend to print on, or
choose a paper that suits the face you wish to use.
</li>
<li>Choose a face that suit the task as well as the subject
</li>
<li>Choose faces that can furnish whatever special effects you require
</li>
<li>consider face natural idiom, individual spirit and character
</li>
<li>begin by buying one good face or family. i.e. choose your
library of faces slowly and well.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Shaping the page</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>p148-149 list a number of page proportions. Fifth and
fourth are considered perfect intervals
</li>
<li>p155-156 (diagram) The Golden section.
a:b = b:(a+b)
1:ϕ (phi). It is a ratio of 38.2%/61.8% or approximately
1/1.6
</li>
<li>Fibonacci series are very good to choose type size
5•8•13•21•34•55…
Interlocking series can also be used
4•7•11•18•29…
6•10•16•26•42… (this one is doubling Finobacci so it is
special and can be used to form a two stranded Finobacci)
Two stranded Finobacci
6•8•10•13•16•21•26•34•42
double stranded finobacci used by le corbusier
4 - 5 - 6.5 - 8 - 10.5 - 13 - 17 - 21 - 27.5 - 34 - 44.5 -
55 - 72 - 89
</li>
<li>Choose inherently satisfying page proportions in
preference to stock sizes or arbitrary shapes.
</li>
<li>Choose page proportions suited to the content, size and
ambition of the publication
</li>
<li>If the text is meant to invite continuous reading, set it
in columns that are clearly taller than wide.
</li>
<li>Shape the text-block so that it balances and contrasts
with the shape of the overall page. p164 shows a good
example of a text-block.
</li>
<li>Bring the margins into the design
<ul class="org-ul">
<li>Lock the text-block to the page and lock the facing
pages to each other
</li>
<li>Frame the text-block
</li>
<li>protect the text-block
</li>
</ul>
</li>
<li>Bring the design into the margins
Paragraphs indents, blank lines, marginal notes…
</li>
<li>Mark the reader's way. Folios are useful in documents
larger than two pages. p165
</li>
<li>Don't restate the obvious
Running heads are bad except in anthologies and works of reference.
</li>
<li>Modular scales are better than grids because they are
more flexible. Grids are used when unpredictable
elements must be combined in a rapid and orderly way.
p169 shows an example of page layouts.
</li>
<li>Adjusts the type and the spaces within the text-block
using typographic increments, but rely on free
proportions to adjust the empty space.
</li>
<li>Keep the design supple enough to provide a livable home
for the text
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> The state of the art</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>9.1 p 179 ASCII ISO and characters set
</li>
<li>ASCII American Standard Code for Information Interchange
 Each character was limited to seven bits of binary information
 so maximum number of characters was 2<sup>7</sup> = 128 - 33 control
codes - 1 for empty space = 94 slots. Not enough for even
 French, Spanish etc.
</li>
<li>Extended ASCII is made from 8bits characters. 2<sup>8</sup>=256 slots.
Depending on software it makes 216-230 characters available.
It is meagre but adequate for basic communication in all the
official languages of western Europe and north America.
</li>
<li>Unicode &gt; 100 000 Characters
</li>
<li>Formats:
<ul class="org-ul">
<li>Bitmapped fonts
</li>
<li>Postcript fonts defined as scalable
<ul class="org-ul">
<li>Type One (T1)
</li>
</ul>
</li>
<li>TrueType
<ul class="org-ul">
<li>Gx
</li>
<li>TTO (TrueType Open)
</li>
</ul>
</li>
<li>OpenType (OT or OTF)
</li>
</ul>
<p>
Postscript and TrueType have a different approach to hinting
and descriptive mathematic different.
</p>

<p>
TrueType and OpenType can accomodate large character set with
automatic contextual substitution of variants and ligatures.
</p>
</li>
<li>Manual, random and programmed variation
Means one font incorporate differents ligatures and glyphs
depending on the situation.
</li>
<li>Use the best available justification engine
</li>
<li>It the text will be read on the screen, design it for that medium
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Grooming the font</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>Check the license before tuning a digital font
</li>
<li>Respect the text first of all, the letter-forms second, the
type designer third, the foundry fourth
</li>
<li>If text figures, ligatures or other glyphs you need on a
regular basis. Don't reside on the base font, move them.
</li>
<li>It is wise to check the font by running a test file p204-205
</li>
<li>Check the kerning of the space
</li>
<li>Naming conventions: sometimes fonts of the same family are not
linked because of a small naming mistake.
</li>
</ul>


<p>
Appendixes are interesting (glossary of typographic terms).
</p>
</div>
</div>
